tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gdbm'
brew 'git'
brew 'htop'
brew 'icu4c'
brew 'openssl'
brew 'mongodb'
brew 'node'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'wget'
brew 'imagemagick'

cask 'atom'
cask 'docker'
cask 'docker-toolbox'
cask 'google-chrome'
cask 'firefox'
cask 'gitter'
cask 'hyper'
cask 'iterm2'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

cask 'font-dejavu-sans'
cask 'font-dejavu-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'
