# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "mongodb/brew"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "github/gh"
tap "rschmitt/heatseeker"
tap "wtfutil/wtfutil"

# Brews
## AWS
brew "aws-iam-authenticator" # Use AWS IAM credentials to authenticate to Kubernetes
brew "awscli" # Official Amazon AWS command-line interface

## Langs, Linters, Databases, Package Managers, and Build tools
brew "bazel" # Google's own build tool
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "borkdude/brew/babashka" # A Clojure babushka for the grey areas of Bash
brew "borkdude/brew/clj-kondo" # A minimal and opinionated linter for Clojure code that sparks joy.
brew "candid" # Small Clojure interpreter and linter
brew "clojure" # The Clojure Programming Language
brew "hadolint" # Smarter Dockerfile linter to validate best practices
brew "leiningen" # Build tool for Clojure
brew "maven" # Java-based project management
brew "nvm" # Manage multiple Node.js versions
brew "planck" # Stand-alone ClojureScript REPL
brew "postgresql" # Object-relational database system
brew "prettier" # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "python" # Interpreted, interactive, object-oriented programming language
brew "rbenv" # Ruby version manager
brew "ruby-build" # Install various Ruby versions and implementations
brew "sqlite" # Command-line interface for SQLite
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "yarn" #

## Kubernetes Tools
brew "helm" # The Kubernetes package manager
brew "kops" # Production Grade K8s Installation, Upgrades, and Management
brew "kubectx" # Tool that can switch between kubectl contexts easily and create aliases
brew "kubernetes-cli" # Kubernetes command-line interface
brew "kubernetes-helm" # The Kubernetes package manager

## Scripting
brew "automake" # Tool for generating GNU Standards-compliant Makefiles
brew "autoconf" # Automatic configure script builder

## Utils
brew "ack" # Search tool like grep, but optimized for programmers
brew "atombender/ktail/ktail" # a tool to tail Kubernetes logs.
brew "bat" # Clone of cat with syntax highlighting and Git integration
brew "circleci" # Enables you to reproduce the CircleCI environment locally
brew "colordiff" # Color-highlighted diff output
brew "coreutils" # GNU File, Shell, and Text utilities
brew "ctags" # A maintained ctags implementation
brew "delta" # Programatically minimize files to isolate features of interest
brew "direnv" # Load/unload environment variables based on $PWD
brew "exa" # Modern replacement for 'ls'
brew "fasd" # CLI tool for quick access to files and directories
brew "fd" # Simple, fast and user-friendly alternative to find
brew "findutils" # Collection of GNU find, xargs, and locate
brew "fzf" # Command-line fuzzy finder written in Go
#brew "gdbm" # GNU database manager
brew "geoip" # This library is for the GeoIP Legacy format (dat)
brew "git-lfs" # Git extension for versioning large files
brew "git" # Distributed revision control system
brew "github/gh/gh" # GitHub CLI
brew "gnu-getopt" # Command-line option parsing utility
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "grc" # Colorize logfiles and command output
brew "hstr" # Bash and zsh history suggest box
brew "htop" # Improved top (interactive process viewer)
brew "icu4c" # C/C++ and Java libraries for Unicode and globalization
brew "jenv" # Manage your Java environment
brew "joplin" # Note taking and to-do application with synchronisation capabilities
brew "jq" # Lightweight and flexible command-line JSON processor
brew "mas" # Mac App Store command-line interface
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "mycli" # CLI for MySQL with auto-completion and syntax highlighting
#brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "nmap" # Port scanning utility for large networks
brew "openssl" # Cryptography and SSL/TLS Toolkit
#brew "packer" # Tool for creating identical machine images for multiple platforms
brew "pandoc" # Swiss-army knife of markup format conversion
#brew "parallel" # Shell command parallelization utility
brew "pcre" # Perl compatible regular expressions library
brew "pup" # Parse HTML at the command-line
brew "ranger" # File browser
brew "readline" # Library for command-line editing
brew "reattach-to-user-namespace" # Reattach process (e.g., tmux) to background
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rlwrap" # Readline wrapper: adds readline support to tools that lack it
brew "rschmitt/heatseeker/heatseeker" # A high-performance general purpose fuzzy finder, based on selecta
brew "sops" # Editor of encrypted files
brew "ssh-copy-id" # Add a public key to a remote machine's authorized_keys file
#brew "syncthing" # Open source continuous file synchronization application
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "telnet" # User interface to the TELNET protocol
brew "the" #_silver_searcher Code-search similar to ack
brew "tig" # Text interface for Git repositories
brew "tmux" # Terminal multiplexer
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "unrar" # Extract, view, and test RAR archives
brew "up" # Tool for writing command-line pipes with instant live preview
brew "urlview" # URL extractor/launcher
brew "wget" # Internet file retriever
brew "wtfutil" # The personal information dashboard for your terminal
brew "yq" # Process YAML documents from the CLI

## zsh
brew "zsh" # The Z shell (ZSH)
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for ZSH
brew "zsh-completions" # Additional completion definitions for ZSH.
brew "zsh-syntax-highlighting" # Fish shell-like syntax highlighting for ZSH.
brew "zsh-history-substring-search" # ZSH port of Fish history search (up arrow)


# Casks
## Fonts
cask "font-dejavu-sans-mono-for-powerline" # Monospaced font for terminal powerline
cask "font-dejavu-sans" # Monospaced font based upon Bistream Vera
cask "font-fira-code" # Monospaced font with programming ligatures
cask "font-hack" # A typeface designed for source code https://sourcefoundry.org/hack/
cask "font-inconsolata" # A monospace font, designed for code listings and the like

## Browsers
cask "firefox"
cask "google-chrome"

## Developer Apps
cask "docker" # platform as a service products that uses OS-level virtualization to deliver software
#cask "emacs" # the extensible, customizable, self-documenting, real-time display editor
#cask "gitter" # a chat and networking platform for open source communities
#cask "hyper" # A terminal built on web technologies
cask "iterm2" # Replacement for Terminal and the successor to iTerm
#cask "kitematic" # The easiest way to use Docker on Mac
cask "ngrok" # secure introspectable tunnels to localhost -  webhook development tool and debugging tool
#cask "robo-3t" # MongoDB GUI
#cask "sourcetree" # Simple and powerful git GUI
cask "visual-studio-code" # Code editing. Redefined. Free. Built on open source. Runs everywhere.

## Learning Tools
brew "exercism" # Kata Exercises via exercism.io


## Productivity Tools
cask "rectangle" # a window management app based on Spectacle, written in Swift.

## Apps
#cask "caffeine" # one click to prevent your Mac from automatically going to sleep
#cask "google-drive-file-stream"
cask "recordit"
#cask "slack"
cask "spotify"
#cask "zoomus"

## Security Tools
cask "suspicious-package"

# Quick Look Utils
cask "betterzipql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# Mac App Store Apps
#mas "Bear", id: 1091189122
#mas "Dato", id: 1470584107
#mas "Keynote", id: 409183694
#mas "mSecure", id: 412367339
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
#mas "Xcode", id: 497799835
