tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "rschmitt/heatseeker"
tap "wtfutil/wtfutil"
brew "aws-iam-authenticator"
brew "bat"
brew "readline"
brew "clojure"
brew "colordiff"
brew "coreutils"
brew "exa"
brew "exercism"
brew "fd"
brew "findutils"
brew "fzf"
brew "gdbm"
brew "geoip"
brew "git"
brew "git-flow"
brew "go"
brew "helm"
brew "hstr"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "mas"
brew "maven"
brew "moreutils"
brew "nmap"
brew "nvm"
brew "pandoc"
brew "pcre"
brew "postgresql"
brew "sqlite"
brew "python"
brew "ranger"
brew "ripgrep"
brew "shellcheck"
brew "sops"
brew "tealdeer"
brew "telnet"
brew "tig"
brew "tree"
brew "up"
brew "wget"
brew "wtfutil"
brew "yarn"
brew "github/gh/gh"
brew "rschmitt/heatseeker/heatseeker"
cask "atom"
cask "betterzipql"
cask "caffeine"
cask "docker"
cask "docker-toolbox"
cask "firefox"
cask "font-dejavu-sans"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "gitter"
cask "google-chrome"
cask "grammarly"
cask "hyper"
cask "iterm2"
cask "java"
cask "keepingyouawake"
cask "ngrok"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "recordit"
cask "robo-3t"
cask "screenhero"
cask "skitch"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "suspicious-package"
cask "vectr"
cask "virtualbox"
cask "visual-studio-code"
cask "webpquicklook"
cask "zoomus"
mas "Bear", id: 1091189122
mas "Dato", id: 1470584107
mas "Keynote", id: 409183694
mas "mSecure", id: 412367339
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
